Revit 2027 API
ExternallyTaggedBRep Class
 An ExternallyTaggedSolid can hold any shape created by BRepBuilder.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExternallyTaggedGeometryObject
 Autodesk.Revit.DB.ExternallyTaggedBRep
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ExternallyTaggedBRep : ExternallyTaggedGeometryObject
Public Class ExternallyTaggedBRep
	Inherits ExternallyTaggedGeometryObject
public ref class ExternallyTaggedBRep : public ExternallyTaggedGeometryObject
type ExternallyTaggedBRep =
    class
        inherit ExternallyTaggedGeometryObject
    end
The ExternallyTaggedBRep type exposes the following members.
Properties
Name | Description
ExternalId |  The external Id of the geometry object.
(Inherited from ExternallyTaggedGeometryObject)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from ExternallyTaggedGeometryObject)
Top
Methods
Name | Description
Dispose
(Inherited from ExternallyTaggedGeometryObject)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetTaggedGeometry |  Returns the externally tagged geometry object.
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB Namespace